[
  {
    "path": "posts/2021-03-16-dataviz-makeover-3/",
    "title": "Dataviz Makeover 3",
    "description": "DataViz Makeover 3 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "LIM Kai Chin",
        "url": "https://www.linkedin.com/in/kai-chin-lim-a5030b156/"
      }
    ],
    "date": "2021-03-16",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Data Visualisation1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2.0 Alternative Design2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Visualisation\r\n4.0 Step-by-Step Guide4.1 Data Preparation\r\n4.2 Pie Chart\r\n4.3 Trellis Maps\r\n4.4 Detailed Map\r\n4.5 Line Chart\r\n4.6 Bar Chart\r\n4.7 Dashboard Preparation\r\n4.8 Dashboard\r\n\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Data Visualisation\r\nThe original visualisation can be seen here. \r\n1.1 Clarity\r\nThe y-axes of the line charts are not synchronised, which might lead to users misinterpreting the pattern and scale of the number of conflicts occurring, especially when comparing large number of events like Battles, versus small, one-off events like Explosions.\r\nThere is no count of events occurring on the plotted map, which leaves to the reader to estimate the counts for each conflict event.\r\nThe dot plot on the map considers the entire time series’ worth of data, which removes the chronological aspect of the data.\r\nThere are no reference points on the line graph to show the count, leaving the user to extrapolate the from the y-axis.\r\nThe sub-events are not plotted, which may be misleading considering that there are sub-events that are “pacifist” in nature, such as “Peaceful Protests”, “Agreement”, or “Change of Group / Activity”.\r\n1.2 Aesthetics\r\nThe chosen colours do not show up distinctively on the map, especially in locations that have many instances of conflicts occurring.\r\nThere is no transparency in the plotted points on the map, leading to overlapping of plotted dots in locations where there are many conflicts happening, for example, in the area depicting Rakhine state in Myanmar.\r\nThe y-axis titles of the line charts were not changed, leaving it as “count of sheet1”, which is not very professional and clean.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nThe y-axes of the line charts are synchronised across categories to improve the visualisation of the scale.\r\nDifferent maps are used to view different levels of data, with a pie chart map to visualise the breakdown of conflicts by area, and a proportionate symbol map to show a detailed representation of the various events that occurred.\r\nTime series can be visualised using a trellis map plot to visualise the number of conflicts that occur over time. Bar charts are used to view a breakdown of all events occurring in the country.\r\nThe total number of events that occurred are shown as values on the dashboard in the detailed proportionate symbol map. This keeps the total events in view even as the user is deep diving into the singular events.\r\n2.2 Aesthetic\r\nThe colours are kept consistent across the maps. Transparency is present for the detailed map to allow some of the overplotted dots to show through.\r\nThe different plots are controlled using a parameter, with the user being able to choose all plots for a quick overview, or different plots to use the correct plot for the correct level of analysis.\r\nAxis titles were changed to ensure that the graphs remained readable.\r\nVarious parameters are present for Country, State, Event Type, Sub-event type, and Year to allow the user to control their preferences accordingly.\r\n3.0 Proposed Visualisation\r\nPlease view the interactive visualisation on Tableau Public here.\r\n4.0 Step-by-Step Guide\r\n4.1 Data Preparation\r\nNo\r\nStep\r\nAction\r\n1\r\nImport the data into Tableau. Change Latitude and Longitude into their respective Geographical Role.\r\n\r\n2\r\nRename Admin1 to State, Location to City, and create a hierarchy.\r\n\r\n3\r\nRepeat this for Event Type and Sub Event Type. Reorder both Location and Event hierarchy suitable to their levels.\r\n\r\n4\r\nCreate a calculated field for Count, putting 1 as the input.\r\n\r\n5\r\nCreate a parameter called Level, with Country and State om the selection list.\r\n\r\n6\r\nCreate a calculated field called Lat (Country) with the following formula. Repeat this for Longitude.\r\n\r\n7\r\nRepeat the previous step for State Level.\r\n\r\n8\r\nCreate a calculated field for Longitude Selection with the following formula. This will select the correct longitude aggregation when the respective view is selected. Repeat for Latitude\r\n\r\n9\r\nEnsure that the created Latitude and Longitude fields are in the correct geographical role.\r\n\r\n10\r\nCreate a parameter for view selection for the various graphs and map visualisations. List out the map titles using a custom list. This list will be used for selection later.\r\n\r\n11\r\nCreate a calculated field called display for the View parameter. This will be used for display selection later.\r\n\r\n12\r\nCreate a calculated field called AGG to count the number of events that had occurred.\r\n\r\n4.2 Pie Chart\r\nNo\r\nStep\r\nAction\r\n1\r\nDrag Long Selection and Lat Selection into the column and row respectively.\r\n\r\n2\r\nChange the mark to a pie chart, drag event types into Colour, SUM(Count) into Size and Angle. Add the Display and Count into the Level of Detail mark. Add SUM(Count) into the Text mark. This will create a pie chart on the map visualisation.\r\n\r\n3\r\nAdd in the relevant parameters in the filters tab.\r\n\r\n4\r\nPut the Display calculated field into the filter list. Select the custom value list, type in “Map” and select the “+” option to add this to the list. Repeat for “All”. This will hide the visualisation when other options are selected in the “Select a view” parameter. This will display the visualisation only when Map or All is selected in the “Select a View” parameter.\r\n\r\n5\r\nChange colours and opacity to match preferences.\r\n\r\n6\r\nThe basic pie chart map is created. This allows users to pick and choose the various countries, cumulative events over years, and the breakdown of event type in the country and state level.\r\n\r\n4.3 Trellis Maps\r\nNo\r\nStep\r\nAction\r\n1\r\nPlace AGG(Full Count), Country and Year in the Level of Detail mark. Place AGG(Full Count) into the Size mark.\r\n\r\n2\r\nPlace Year and Long Selection into columns, and Lat Selection into Rows. This will create a proportionate geographical map.\r\n\r\n3\r\nAdd in the relevant parameters for the filter tab.\r\n\r\n4\r\nRepeat the step for the Display calculated field, this time using “Trellis” instead of “Map”.\r\n\r\n4.4 Detailed Map\r\nNo\r\nStep\r\nAction\r\n1\r\nChange the mark type to a Shape, drag Event Type into Colour, Sub Event Type into Shape, and add Event ID Cnty, Year, Country, & State, into the Level of Detail mark.\r\n\r\n2\r\nDrag the Longitude and Latitude into the Columns and Rows respectively. Ensure that they are both in the Dimension format.\r\n\r\n3\r\nAdd in the relevant parameters for the filter tab.\r\n\r\n4\r\nRepeat the step for Display and use Detailed instead of Map\r\n\r\n5\r\nChange opacity and colour to suit preferences.\r\n\r\n6\r\nThe Detailed visualisation will look similar to this.\r\n\r\n4.5 Line Chart\r\nNo\r\nStep\r\nAction\r\n1\r\nCreate a Breakdown parameter, with All and Country as the custom list for selection.\r\n\r\n2\r\nCreate another parameter for Event level, with Event and Sub Event as the custom list for selection.\r\n\r\n3\r\nCreate a calculated field called Event Selection with the following formula to select the view level for events.\r\n\r\n4\r\nCreate a calculated field called View Breakdown with the following formula to select the breakdown level.\r\n\r\n5\r\nPlace event selection and YEAR(Year) into columns, and CNT(Event Id Cnty) into Rows. Add another instance of CNT(Event Id Cnty) for a dual axis.\r\n\r\n6\r\nRight-click on the second axis, ensure that Synchronize Axis is checked, and ensure that Show Header is unchecked to remove the secondary axis.\r\n\r\n7\r\nChange the Level 1 mark to a Line mark, Use View Breakdown for colour, and Event selection for Level of Detail.\r\n\r\n8\r\nChange the Level 2 mark to a circle mark.\r\n\r\n9\r\nSelect Show Mark Labels to ensure that the text is shown on the plotted points.\r\n\r\n10\r\nThe line chart will look something like this. This will be used to visualise the time series at various levels of aggregation, for All, Country, or State level, & segregated into Event and Sub-event categories.\r\n\r\n4.6 Bar Chart\r\nNo\r\nStep\r\nAction\r\n1\r\nUse view breakdown, CNT(Event Id Cnty), and Event Selection into the various marks as seen in the snapshot. Change marks to a bar chart.\r\n\r\n2\r\nMove Country into columns, and Event Selection and CNT(Event id Cnty) into rows.\r\n\r\n3\r\nAdd in the relevant parameters for the filter tab.\r\n\r\n4\r\nRepeat the step for Display and use “Bar chart” instead of “Map”\r\n\r\n5\r\nThe bar chart will look similar to this. This explains the breakdown of events in each country.\r\n\r\n4.7 Dashboard Preparation\r\nNo\r\nStep\r\nAction\r\n1\r\nDrag SUM(Count) into the text box. Add in the relevant parameters in the filters tab as required.\r\n\r\n2\r\nFormat the Label as desired.\r\n\r\n3\r\nThe sheet will look something like this.\r\n\r\n4\r\nAdd the Display calculated field, and use “Detailed” for the sheet. This will act as a total count and aggregate numbers in the dashboard and will only appear when the Detailed map is selected.\r\n\r\n5\r\nCreate a new worksheet, add Event Type to the text box, and repeat the previous steps. This will create a worksheet that will showcase the breakdown of event types.\r\n\r\n4.8 Dashboard\r\nNo\r\nStep\r\nAction\r\n1\r\nDrag all relevant sheets into the dashboard. Remove any repeated legends that might appear.\r\n\r\n2\r\nSelect the down arrow and ensure that the parameter filters are applied to all using the data source. Repeat for any other parameters in the dashboard.\r\n\r\n3\r\nThe type of charts, level of view, event dates, country, state, event and sub event types can all be changed depending on the information that the user would like to view.\r\n\r\n5.0 Derived Insights\r\nThere was a significant spike in violence against civilians in 2016. \r\nThe data was further drilled into and viewed at country level. \r\nA significant proportion of violence against civilians (2,400 events out of 2,700 events) were from the Philippines. 2016 was when current President Duterte was elected. He was elected on a campaign promise to be tough on crime and to eliminate drug traffickers )The Guardian, 2016), creating a climate where anyone can be easily killed in the “war on drugs” (Amnesty International, 2016). Although it seems to be decreasing, there still seems to be significant levels of violence against civilians in the Philippines.\r\nThe country with the greatest number of battles over the past 10 years is in Myanmar.\r\n\r\nDrilling down into the data from Myanmar, the largest number of battles happened in Shan State, with 2,040 battles occurring. A similar situation is happening in Kachin state. \r\nThere has been an ongoing ethnic conflict and independence movement in the Shan state against the Myanmar government for almost 50 years (Graceffo,2019). Both Shan and Kachin have armed groups that have allied into a coalition called the Northern Alliance, which has been engaging in various battles with the Myanmar Army (Human Rights Watch, 2019).\r\nMost battles occur in 3 main areas, Northern Myanmar, Southern Thailand, and Southern Philippines. This is consistent with the various conflicts that are occurring in the ASEAN region. Besides Northern Myanmar that was explained above, both South Thailand and South Philippines have independence movements by the Muslim minorities that reside there.\r\n\r\nDrilling down into the time series, disregarding 2020 as it was a pandemic year with many lockdowns in many of the regions, it seems like the number of battles is trending upwards from 2014 to 2019.\r\n By dividing it into country level, we can see that Myanmar and the Philippines have the greatest number of battles, and it may trend further upwards considering recent developments in Myanmar, with a coup d’etat occurring in Feburary 2021. \r\nThere are some missing data in the dataset. The first entries for Indonesia, the Philippines, and Malaysia are 2015, 2016, and 2018 respectively. There seemingly is a downward trend for the Philippines from 2016 to 2019, which may be derived from a decreasing amount of violence against civilians (as shown in point 3). \r\nMost of the explosions have occurred in Thailand, with approximately 56% of explosions over the entire time period, with 2,300 events.\r\n Of this, about 1,600 events occurred in the Southern states of Narathiwat and Pattani.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-18T13:52:27+08:00",
    "input_file": "dataviz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-01-dataviz-makeover-2/",
    "title": "Dataviz Makeover 2",
    "description": "DataViz Makeover 2 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "LIM Kai Chin",
        "url": "https://www.linkedin.com/in/kai-chin-lim-a5030b156/"
      }
    ],
    "date": "2021-02-01",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Alternative Design2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Visualisation\r\n4.0 Step-by-step Guide4.1 Graphing a Likert Chart\r\n4.2 Graphing Uncertainty\r\n4.3 Dashboarding\r\n\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below.\r\n\r\n1.1 Clarity\r\nThe use of stacked bar charts results in readers having to estimate the proportion across different countries. This is hard to compare, as the baseline of each option keeps shifting, which may lead to misinterpretations.\r\nBoth charts are sorted differently, with Chart 1 (general response chart) being sorted alphabetically by country, while Chart 2 is sorted by percentage of strongly agrees. As they are put side-by-side, users may misinterpret that the Y-axis categories are the same.\r\nChart 2 has many values that are quite close, such as Sweden, Canada, Norway, Finland, and Italy. It is hard to make comparisons between these countries without any percentage values or reference lines shown.\r\nThe x-axis of Chart 2 is only up to 60%. This may confuse the reader as it would over-emphasize those that strongly agree since the max value for Chart 2 is the same length as one of the stacked bar charts in Chart 1.\r\n1.2 Aesthetic\r\nThe colour selection of the bar charts is not optimal. Red is usually used as an eye-catching colour for poor performance or as a highlight. Here, it is used for Option 3, neutral. This is against convention.\r\nThe same blue is used for Option 1, Strongly agree, and the percentage of strongly agreed to vaccination. The same colours can be confusing at first glance.\r\nThere are typos in Chart 1 title, as vaccine is mis-spelled as “vacinne”\r\nThe units for the x-axes of both graphs are not fully standardised as Chart 1 has no decimal places, but Chart 2 is up to 1 decimal place.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nInstead of a stacked bar chart, a likert scale chart is used to represent the diverging nature of the responses. This more clearly represents the proportions and visual scale of the differing opinions of different countries.\r\nAs there is only 1 x-axis for the likert chart, there is no confusion on the size and scale of different bars. X-axis is also fixed to prevent shifting of the 0 value.\r\nThe values for the uncertainty chart follows the statement being mentioned in the likert chart, so it is clear that both charts are talking about the same statement / question.\r\nThe reference band for different confidence levels will be shaded slightly less dark compared to the mean value, with the confidence level being stated clearly to show uncertainty.\r\nBoth visualisations are sorted in the same way, so as to allow for easier comparison across visualisations.\r\n2.2 Aesthetic\r\nThe colours selected will be more in line with convention, with redder colours representing negative opinions.\r\nThe legend is updated to reflect the options for opinions more clearly by describing all options (1 = Strongly Agree, 2 = Agree, 3 = Neutral, 4 = Disagree, 5 = Strongly Disagree)\r\nA reference line at 0% is used in the likert chart to further emphasize the diverging opinions.\r\nDifferent parameters are used to enable the user to select their preferred category for further analysis instead of having an aggregated data visualisation, as there might be variation of opinion between groups.\r\n3.0 Proposed Visualisation\r\nPlease view the interactive visualisation on Tableau Public here.\r\n4.0 Step-by-step Guide\r\n4.1 Graphing a Likert Chart\r\nNo\r\nStep\r\nAction\r\n1\r\nIn the data source tab, select the New Union function and import all data sheets using a manual connection.\r\n\r\n2\r\nExport the data using the View Data function.\r\n\r\n3\r\nImport cleaned data into a new Tableau sheet. Split Table Names using the custom split function to create a new column called “Country”.\r\n\r\n4\r\nCreate a new parameter field for question selection. Use the list function and list out the relevant questions as variables. Key in text fields in the Display As column to explain the questions for more clarity.\r\n\r\n5\r\nCreate new Calculated Field and set the cases when different questions are selected.\r\n\r\n6\r\nCreate new Calculated field to convert them from string into an integer format.\r\n\r\n7\r\nCreate a record list using a calculated field and setting the value as 1.\r\n\r\n8\r\nCreate a Total Count Calculated Field.\r\n\r\n9\r\nCreate a Count Negative Calculated Field to define the values for the likert scale diagram.\r\n\r\n10\r\nCreate a Total Count Negative Calculated Field to consolidate all negative values.\r\n\r\n11\r\nCreate a Gantt Start Calculated Field to define the start of the Gantt Chart.\r\n\r\n12\r\nCreate a Gantt Percentage Calculated Field to define the size and scale of the likert scale diagram.\r\n\r\n13\r\nCreate a Percentage Calculated Field to define the size of the bar chart.\r\n\r\n14\r\nInsert variables into the Rows and Columns selector.\r\n\r\n15\r\nAdd Question selector to Detail and Colour, Percentage to Size, and change the graph type to Gantt Bar.\r\n\r\n16\r\nEnsure that the Gantt Percentage chart is calculated using the Question Selector Variable.\r\n\r\n17\r\nAdd a reference line at the 0 value on the x-axis.\r\n\r\n18\r\nBase visualisation with variable selections for question looks like this.\r\n\r\n19\r\nCreate another parameter for demographic selection, this time filling in the values for the selected variables. Change the display name as required. Use “(All)” in the parameter field to ensure that there is a master parameter selection.\r\n\r\n20\r\nCreate a Calculated Field that sets the correct demographic case when the associated variable is selected.\r\n\r\n21\r\nEnsure that all the demographics are in string / categorical format.\r\n\r\n22\r\nCreate groups for the Age variable to bin the values to make them into categorical variables.\r\n\r\n23\r\nBin sizes should be something reasonable, for example, a range of 5 years.\r\n\r\n24\r\nRepeat for the group creation step for Household Children, grouping them into fewer categories.\r\n\r\n25\r\nRepeat for the group creation step for Household size, grouping them into fewer categories.\r\n\r\n26\r\nDisplay the filter for the Demographic Selector Calculated Field.\r\n\r\n27\r\nAdd a filter to exclude Null replies for the Question Selector variable if any.\r\n\r\n28\r\nAdd aliases to the Question Selector variable to give more clarity for the values.\r\n\r\n29\r\nConfirm that the Question Selector is sorted correctly. If there are errors, select on an option and adjust with the arrows.\r\n\r\n30\r\nAdd the Demographic Selector to the Rows, and the base design of the sheet is created.\r\n\r\n31\r\nFix the x-axis to prevent the reference line from shifting when parameters change to avoid confusing users.\r\n\r\n32\r\nEdit the tooltip to give explanations on the various values and parameters used.\r\n\r\n33\r\nRight click and rename titles to more suitable statements for dashboarding.\r\n\r\n34\r\nRearrange panels to suit aesthetic preference and add captions if needed. This is a view of the final product.\r\n\r\n4.2 Graphing Uncertainty\r\nNo\r\nStep\r\nAction\r\n1\r\nCreate a Calculated Field called Proportion with the following formula. This is to find the number of respondents that gave a Strongly Agree or Agree score.\r\n\r\n2\r\nCreate a Calculated Field called Prop_SE with the following formula. This is to find the standard error for the uncertainty of the proportion.\r\n\r\n3\r\nCreate Calculated Fields for z-values for various confidence levels. In this case, z-values for 90%, 95%, and 99% were created.\r\n\r\n4\r\nCreate a Parameter to select desired confidence level. Keep data types as String and list out the various confidence levels that were created in the previous step.\r\n\r\n5\r\nCreate a Calculated Field to select for the confidence level input with the following formula\r\n\r\n6\r\nCreate a Calculated Field to determine the correct lower bound of the confidence interval, using this formula.\r\n\r\n7\r\nDuplicate the Calculated Field and change the formula to create the upper bound for the confidence interval.\r\n\r\n8\r\nDrag Proportion and Country into the Columns and Rows, respectively. This will create a preliminary baseline for the uncertainty chart.\r\n\r\n9\r\nDrag Measure Values into the Columns tab and remove all irrelevant information, leaving only Prop_Lower Bound and Prop_Upper Bound.\r\n\r\n10\r\nChange the chart to a line graph, then drag Measure Names into the Detail Tab. Change Measure names from a Detail to a Path.\r\n\r\n11\r\nCreate a dual axis chart by right-clicking on the x-axis. Remember to select Synchronise Axis to align the x-axes.\r\n\r\n12\r\nRepeat step X to Y for a comparison level of confidence interval. Drag these new upper bounds and lower bounds into Measure Values.\r\n\r\n13\r\nCtrl-drag Measure Names into the Colour tab.\r\n\r\n14\r\nSelect the Colours tab, edit the various colours so that the Lower and Upper bound match up with the correct pair.\r\n\r\n15\r\nClick on the arrow at the side and select sort. Pair up each of the respective lower and upper bounds.\r\n\r\n16\r\nDrag Demographic Select field that was previously created into the row to allow for variable selection for the demographic parameters.\r\n\r\n17\r\nEdit the tooltip to display information to the user.\r\n\r\n18\r\nThe final layout of the uncertainty sheet is complete.\r\n\r\n4.3 Dashboarding\r\nNo\r\nStep\r\nAction\r\n1\r\nDrag the Uncertainty sheet into the dashboard. Rearrange and align to fit the screen and ensure readability.\r\n\r\n2\r\nSelect the arrow for the Country Parameter, go to Apply to Worksheets sub-menu and ensure that the All Using This Data Source option is selected. This will ensure that this Parameter can control both visualisations. Repeat step for other relevant parameters that have been included.\r\n\r\n3\r\nThe final dashboard is complete.\r\n\r\n5.0 Derived Insights\r\nFrance is the most “anti-vaccine” country, with the least confidence in a vaccine that they can take next week, with almost 40% of participants expressing a Strongly Disagree opinion for taking a vaccine next week. It also has the smallest proportion of people agreeing with the statement, at only 39%.\r\n\r\nThis has been supported by other surveys conducted by other agencies and polling companies. There may be more instances of vaccine-skepticism or other forms of misinformation driving this in France. This may also be due to cultural norms whereby France is generally more skeptical of vaccines. Euronews, 2021\r\nJapan is the most afraid of side effects from a vaccine, with 79.2% of respondents expressing a Strongly Agree or Agree opinion on worries for side effects for a vaccine. Singapore follows closely behind with 75.8% of participants agreeing with the comment. Generally, all 3 Asian countries rank relatively high on this statement, with all 3 of them placing in the top 5 countries being most concerned. France has also ranked quite high, most possibly being linked to being most skeptical of a vaccine.\r\n\r\nPast vaccine development usually takes many years to develop, and that has caused some concerns, especially in Japan, which may have contributed to the lower confidence in vaccines and the greater concern with side effects, as shown in the visualisation. (Japan Times, 2020)\r\nMales in general are more willing to take a vaccine this week as compared to females. This may be linked to the general worries about side effects for a vaccine, as females are more likely to be worried about side effects, which may in turn decrease their propensity to receive a vaccine.\r\n\r\nSingapore has the most confidence in the government, as the proportion of Strongly Agree and Agree is the highest when asked about whether the government will provide an effective vaccine. This might be due to general high confidence levels in Singapore for the government due to its past records of steering Singapore out of crises.\r\nFrance is the least confident in its government, possibly due to its general lack of confidence in effective vaccines.\r\n\r\nSingapore ranks quite low when asked if there would be any regrets for not taking the vaccine. This might be potentially due to Singapore’s virus situation being well controlled, with only a few cases each day (at point of writing) compared to the other countries on the list. As such, the fear of side effects may outweigh the benefits of immunity in some respondents.\r\nIn comparison, the UK, with the highest death toll in the world per capita (Neilson, 2021), would regret the most.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-18T20:14:57+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-05-my-first-post/",
    "title": "My First R Markdown Document",
    "description": "A new article created using the Distill format.",
    "author": [
      {
        "name": "Dr. Kam Tin Seong",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-24",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-24T13:19:36+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-24-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "LIM Kai Chin",
        "url": "https://www.linkedin.com/in/kai-chin-lim-a5030b156/"
      }
    ],
    "date": "2021-01-24",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Alternative Design2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Visualisation\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below.\r\n\r\n1.1 Clarity\r\nThe title and subtitle of the graph does not convey the intent of the graph well. In this case, the graph is trying to show the increase in median age of the workforce, but the title only mentions that the graph has something to do with the resident labour force by age. The subtitle of percent is also not clear, as it does not mention whether the percentage shown is percent of labour force, percent of entire population, or percent of age group in the work force.\r\nThere is no y-axis, as such, the difference in scale is not conveyed properly. It is hard to compare the different percentages across different age groups.\r\nA line graph is used, which can mislead people into thinking that the lines are meant to be interpreted as a time series and compared across age groups. However, the main topic to is look at the different percentages within the age groups across time.\r\nSome form of transformation is carried out from the original data that is not shown or described in the blurb or the graph. The dataset shows the proportion of each age group in the workforce, whereas the graph shows the percentage of age group as part of the entire workforce. There is no explanation on how the values are derived.\r\n1.2 Aesthetic\r\nThere is poor use of colours in the chart. The background colour is not particularly useful as it does not seem to serve any purpose. Brighter or distinct colouration is not used to convey the point of the median age increasing from 2009 to 2019.\r\n“Chart 6” of the title and the note at the bottom of the graph are not in line with the main graphic.\r\nTick marks are used on the x-axis even though it is a categorical scale.\r\nValues have no scale, which might confuse readers regarding that the values are absolute values.\r\nAnnotations are not used to convey points, leaving the reader to infer the purpose of the graph.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nTitle and subtitle explain key words and definitions that will be used in the graph. No additional transformation is done to the data, only using age group, gender, year, and LFPR as the basis for the graph.\r\nY-axis is added to enable the reader to read and compare LFPR results across different years and age groups more easily.\r\nA slope graph is used, which clearly shows the vertical relationship between LFPR across years, age groups, and gender. It is enables easy identification of changes over time and trends as there is a visual representation of these changes.\r\n2.2 Aesthetic\r\nAnnotations are used to emphasize key observations. Colour is used to bring to attention different categories (e.g., different genders, negative trend in growth)\r\nChart titles and notes are aligned to the main chart.\r\nTick marks are not used for categories.\r\nY-axis is formatted into percentage to clarify that these numbers are a proportion and not absolute numbers.\r\n3.0 Proposed Visualisation\r\nPlease view the interactive visualisation on Tableau Public here\r\n4.0 Step-by-step Guide\r\nNo\r\nStep\r\nAction\r\n1\r\nSelect only the top table for each data set and paste into a new sheet using Microsoft Excel\r\n\r\n2\r\nImport the data into Tableau.\r\n\r\n3\r\nUse Tableau to pivot the data in sheet, with measure values in columns and age in rows.\r\n\r\n4\r\nRemove the CNT in Measure Values\r\n\r\n5\r\nView the data in Tableau.\r\n\r\n6\r\nExport the data and save the file with an appropriate name.\r\n\r\n7\r\nRepeat steps 1 – 6 for both Male and Female sections. Merge the exported files using Microsoft Excel and add a Category column to identify the dataset source.\r\n\r\n8\r\nImport the cleaned dataset into Tableau.\r\n\r\n9\r\nChange the LFPR from value to percentage by adding a calculated field.\r\n\r\n10\r\nChange the data types to the correct ones and rename columns for better clarity.\r\n\r\n11\r\nAdd Age (Years) and YEAR to the Column tab and LFPR to the Rows tab.\r\n\r\n12\r\nChange Measure (Sum) to Measure (AVG) to make it the average for the 3 categories of genders (T, F, M).\r\n\r\n13\r\nAdd a filter to remove Total in the Age (Years) variable.\r\n\r\n14\r\nAdd another filter for Category to include the gender category.\r\n\r\n15\r\nSelect the dropdown menu in the filter tab and select Show Filter to display the filter sidebar.\r\n\r\n16\r\nAdd Category to the Colour side panel to differentiate the genders in the main graph.\r\n\r\n17\r\nAdd a filter for YEAR to include the time series for the data set. Select Year as there is no further level of detail in the dataset.\r\n\r\n18\r\nSelect the desired Years for comparison. In this case, only 2009 and 2019 are chosen. Show the Year filter on the sidebar.\r\n\r\n19\r\nThe base graph should look like this.\r\n\r\n20\r\nAdd another copy of AVG (LFPR%) to create a dual axis.\r\n\r\n21\r\nRight click on the bottom Y-axis and select dual axis chart.\r\n\r\n22\r\nRight click on the right Y-axis, select Synchronize Axis and deselect Show Header.\r\n\r\n23\r\nChange panel from Automatic to Circle to show marks in the main graph.\r\n\r\n24\r\nSelect the size button and resize to desired level.\r\n\r\n25\r\nDuplicate AVG (LFPR %) in the Rows tab, click on the down arrow, and create a Quick Table Calculation for Percentage Difference.\r\n\r\n26\r\nSelect Edit Table Calculation and ensure that the Pane (across) option is selected.\r\n\r\n27\r\nDouble click the variable in the Row tab and copy the formula.\r\n\r\n28\r\nCreate a calculated field for the Difference variable for negative values. Repeat for the positive values.\r\n\r\n29\r\nDrag both the Negative and Positive fields into the label tab. Ensure that the labels go only into the second axis. Double click the Label tab, ensure that Show mark labels is selected, the Most Recent option is selected for Marks to label, and the Pane option is selected for Scope. Recolour the text to the desired colours.\r\n\r\n30\r\nSelect the Multiple Values (dropdown) for the filters to reduce the size of the legend and filter selection.\r\n\r\n31\r\nRight click on the main graph area and select annotate. Type in insights and observations in the text area. Arrange, resize, or format the resulting text box if required.\r\n\r\n32\r\nRight click on the main graph area and select annotate. Type in insights and observations in the text area. Arrange, resize, or format the resulting text box if required.\r\n\r\n33\r\nThe final dashboard is ready!\r\n\r\n5.0 Derived Insights\r\nBetween 2009 and 2019, a 4% increase in total LFPR can be seen. Overall, LFPR is trending upwards across all age groups except 20 - 24. The increase between genders is also quite apparent, as females have seen double digit increases for age groups over 30, whereas the LFPR remains relatively constant or decreased slightly from 2009 to 2019. This may be potentially due to the changing societal roles, where women are less likely to become homemakers as compared to 10 years ago.\r\n\r\n\r\nAdditional social supportsystems have also been put in place since then, such as enhanced maternity benefits and parental leave, flexible work arrangements and telecommuting.\r\nStraits Times, 2017\r\nLarge increases can be seen in the age groups above 60. This may be potentially due to the government introducing a re-employment age whereby companies have to offer re-employment to eligible employees. This legislation was legislated in 2012, with a limit at 65. This age was raised again to 67 in 2017.\r\nChannel News Asia, 2019\r\nMinistry of Manpower, 2021\r\nOnce broken down into the respective genders, the effect is even more pronounced, with a 100% increase and 121% increase in LFPR for Females 65 - 69 and 70 & above respectively.\r\n\r\nThere is a 4% decrease in 20 – 24 age group for all genders. However, once we look at the gender split, the decrease in Male LFPR for that age group is at 9%, whereas the Female LFPR has increased by almost 2%. This might be due to a delay caused by National Service, where a greater proportion of males are still in higher education as compared to females.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T19:35:36+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Idea",
    "description": "Welcome to our new blog, idea. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "LIM Kai Chin",
        "url": "https://www.linkedin.com/in/kai-chin-lim-a5030b156/"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-24T14:53:26+08:00",
    "input_file": {}
  }
]
